app/controllers/csv_imports_controller.rb

SELECT "csv_imports".* FROM "csv_imports" WHERE "csv_imports"."year_id" = ? GROUP BY "csv_imports"."player_id"  [["year_id", 2018]]
SELECT "csv_imports"."team_id" FROM "csv_imports" WHERE "csv_imports"."player_id" = ?  [["player_id", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "csv_imports".* FROM "csv_imports" WHERE "csv_imports"."year_id" = ? AND "csv_imports"."team_id" = ? GROUP BY "csv_imports"."player_id"  [["year_id", 2019], ["team_id", 3]]
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "csv_imports"."team_id" FROM "csv_imports" WHERE "csv_imports"."player_id" = ?  [["player_id", 2]]
SELECT "teams"."team_name" FROM "teams" WHERE "teams"."id" IN (?, ?, ?)  [["id", 2], ["id", 3], ["id", 2]]
SELECT COUNT(*) AS count_all, "csv_imports"."player_id" AS csv_imports_player_id FROM "csv_imports" GROUP BY "csv_imports"."player_id"
SELECT "csv_imports".* FROM "csv_imports" WHERE "csv_imports"."player_id" = ?  [["player_id", 2]]
---
	def show
		debugger
		@data_total = []
		if session[:year].present? && session[:team].empty?
			@data = CsvImport.all.group(:player_id).where(year_id: session[:year])
		elsif session[:team].present? && session[:year].empty?
			@data = CsvImport.all.group(:player_id).where(team_id: session[:team])
		elsif session[:team].present? && session[:year].present?
			@data = CsvImport.all.group(:player_id).where(year_id: session[:year], team_id: session[:team])
		else
			@data = CsvImport.all.group(:player_id)
		end
		@data.each do |d|
			team_ids = CsvImport.where(player_id: d.player_id).pluck(:team_id) rescue nil
			team_names = Team.where(id: team_ids).pluck(:team_name) rescue nil

			batting_average = 0
			if team_ids.length > 1
				players = CsvImport.where(player_id: d.player_id)